Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionItem Constructor
Overload List
Name | Description
BinaryFilterExpressionItem(FilterExpression)
 Initializes a new instance of the BinaryFilterExpressionItem class.
BinaryFilterExpressionItem(FilterExpression, BinaryFilterOperatorType)
 Initializes a new instance of the BinaryFilterExpressionItem class.
Top
See Also
Reference
BinaryFilterExpressionItem Class
Tekla.Structures.Filtering Namespace